bash/bash.org
#+TITLE:     Bash
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS: h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
 #+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: </div>
#+TOC: headlines 3


* 循环

** for


*** 基本用法

#+BEGIN_SRC sh
  for arg; do
      # TODO
  done [ | command ]
#+END_SRC

*** bash 风格

#+BEGIN_SRC sh
  for i in {1..10}; do
      echo -n "$i "
  done
#+END_SRC

*** c 风格

#+BEGIN_SRC sh
  LIMIT=10

  for ((i = 1; i <= LIMIT; i++)); do
      echo -n "$i "
  done
#+END_SRC

#+BEGIN_SRC sh
  LIMIT=10

  for ((i = 1, j = 1; i <= LIMIT; i++, j++)); do
      echo -n "$i-$j "
  done
#+END_SRC


** while

*** 基本用法

#+BEGIN_SRC sh
  while read line; do
      # TODO
  done
#+END_SRC

*** c 风格

#+BEGIN_SRC sh
  (( i = 1 ))

  while (( i <= LIMIT )); do
      echo -n "$i "
      (( i += 1 ))
  done
#+END_SRC




** IFS

可以在循环内部设置 =$IFS= 变量，而不用把原始的 =$IFS= 保存到临时变量中

#+BEGIN_SRC sh
  echo "List of all users:"
  while IFS=: read name passwd uid gid fullname ignore; do
      echo "$name ($fullname)"
  done </etc/passwd
  echo "\$IFS still $IFS"
#+END_SRC


** continue, break

=continue= 命令可以 *带一个参数* ，不带参数的 =continue= 命令只会去掉本次循环的剩余代码，而 =continue N= 将会把 N 层循环的剩余代码都去掉。

=break= 命令 *可以带一个参数* ，一个不带参数的 =break= 命令只能退出最内层的循环，而 =break N= 可以退出 N 层循环。


