bash/bash.html
<!DOCTYPE html>
<html>
<head>
<title>Bash</title>
<!-- 2018-02-05 Mon 15:49 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Bash</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 循环</a>
<ul>
<li><a href="#sec-1-1">1.1. for</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 基本用法</a></li>
<li><a href="#sec-1-1-2">1.1.2. bash 风格</a></li>
<li><a href="#sec-1-1-3">1.1.3. c 风格</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. while</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 基本用法</a></li>
<li><a href="#sec-1-2-2">1.2.2. c 风格</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. IFS</a></li>
<li><a href="#sec-1-4">1.4. continue, break</a></li>
<li><a href="#sec-1-5">1.5. case, select</a></li>
<li><a href="#sec-1-6">1.6. 带步进值的循环</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 函数</a>
<ul>
<li><a href="#sec-2-1">2.1. 在 <code>if/then</code> 结构中定义函数</a></li>
<li><a href="#sec-2-2">2.2. 函数指针</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 声明</a>
<ul>
<li><a href="#sec-3-1">3.1. 声明只读变量</a></li>
<li><a href="#sec-3-2">3.2. 查看变量类型</a></li>
<li><a href="#sec-3-3">3.3. 声明整形变量</a></li>
<li><a href="#sec-3-4">3.4. 声明数组变量</a></li>
<li><a href="#sec-3-5">3.5. 声明函数指针</a></li>
<li><a href="#sec-3-6">3.6. 限制变量作用域</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 测试</a>
<ul>
<li><a href="#sec-4-1">4.1. 测试文件类型</a></li>
<li><a href="#sec-4-2">4.2. 测试文件权限</a></li>
<li><a href="#sec-4-3">4.3. 文件比较</a></li>
<li><a href="#sec-4-4">4.4. <b>整数</b> 比较</a></li>
<li><a href="#sec-4-5">4.5. 字符串比较</a></li>
<li><a href="#sec-4-6">4.6. 多重条件判定</a></li>
<li><a href="#sec-4-7">4.7. 双括号和单括号中的行为比较</a></li>
<li><a href="#sec-4-8">4.8. c 风格</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 变量</a>
<ul>
<li><a href="#sec-5-1">5.1. 变量检查</a></li>
<li><a href="#sec-5-2">5.2. 变量匹配</a></li>
<li><a href="#sec-5-3">5.3. 变量替换</a></li>
<li><a href="#sec-5-4">5.4. 变量赋值</a>
<ul>
<li><a href="#sec-5-4-1">5.4.1. 文件内容赋值</a></li>
<li><a href="#sec-5-4-2">5.4.2. 间接引用</a></li>
</ul>
</li>
<li><a href="#sec-5-5">5.5. 数组变量</a>
<ul>
<li><a href="#sec-5-5-1">5.5.1. 访问</a></li>
<li><a href="#sec-5-5-2">5.5.2. 赋值</a></li>
<li><a href="#sec-5-5-3">5.5.3. 删除</a></li>
<li><a href="#sec-5-5-4">5.5.4. 扩展</a></li>
<li><a href="#sec-5-5-5">5.5.5. 元素个数</a></li>
<li><a href="#sec-5-5-6">5.5.6. Bash 允许把变量当成数组来操作，即使这个变量没有明确地被声明为数组</a></li>
<li><a href="#sec-5-5-7">5.5.7. 对字符串使用数组操作</a></li>
</ul>
</li>
<li><a href="#sec-5-6">5.6. 特殊变量</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 字符串处理</a>
<ul>
<li><a href="#sec-6-1">6.1. 获取字符串变量长度</a></li>
<li><a href="#sec-6-2">6.2. 子串匹配</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1. <b>匹配字符串开头</b> 的子串长度</a></li>
<li><a href="#sec-6-2-2">6.2.2. 匹配字符串中子串第一次出现的位置</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3. 子串提取</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1. 正向提取子串</a></li>
<li><a href="#sec-6-3-2">6.3.2. 反向（从右边开始）提取子串</a></li>
<li><a href="#sec-6-3-3">6.3.3. 从 <b>开始位置</b> 提取 substring (substring 是正则表达式)</a></li>
<li><a href="#sec-6-3-4">6.3.4. 从 <b>结尾</b> 提取 substring (substring 是正则表达式)</a></li>
</ul>
</li>
<li><a href="#sec-6-4">6.4. 子串消除</a></li>
<li><a href="#sec-6-5">6.5. 子串替换</a></li>
<li><a href="#sec-6-6">6.6. 大小写转换</a></li>
</ul>
</li>
<li><a href="#sec-7">7. 参数处理</a>
<ul>
<li><a href="#sec-7-1">7.1. 获取最后一个参数</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-05 15:49:24</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 循环</a>
<ul>
<li><a href="#sec-1-1">1.1. for</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 基本用法</a></li>
<li><a href="#sec-1-1-2">1.1.2. bash 风格</a></li>
<li><a href="#sec-1-1-3">1.1.3. c 风格</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. while</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 基本用法</a></li>
<li><a href="#sec-1-2-2">1.2.2. c 风格</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. IFS</a></li>
<li><a href="#sec-1-4">1.4. continue, break</a></li>
<li><a href="#sec-1-5">1.5. case, select</a></li>
<li><a href="#sec-1-6">1.6. 带步进值的循环</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 函数</a>
<ul>
<li><a href="#sec-2-1">2.1. 在 <code>if/then</code> 结构中定义函数</a></li>
<li><a href="#sec-2-2">2.2. 函数指针</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 声明</a>
<ul>
<li><a href="#sec-3-1">3.1. 声明只读变量</a></li>
<li><a href="#sec-3-2">3.2. 查看变量类型</a></li>
<li><a href="#sec-3-3">3.3. 声明整形变量</a></li>
<li><a href="#sec-3-4">3.4. 声明数组变量</a></li>
<li><a href="#sec-3-5">3.5. 声明函数指针</a></li>
<li><a href="#sec-3-6">3.6. 限制变量作用域</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 测试</a>
<ul>
<li><a href="#sec-4-1">4.1. 测试文件类型</a></li>
<li><a href="#sec-4-2">4.2. 测试文件权限</a></li>
<li><a href="#sec-4-3">4.3. 文件比较</a></li>
<li><a href="#sec-4-4">4.4. <b>整数</b> 比较</a></li>
<li><a href="#sec-4-5">4.5. 字符串比较</a></li>
<li><a href="#sec-4-6">4.6. 多重条件判定</a></li>
<li><a href="#sec-4-7">4.7. 双括号和单括号中的行为比较</a></li>
<li><a href="#sec-4-8">4.8. c 风格</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 变量</a>
<ul>
<li><a href="#sec-5-1">5.1. 变量检查</a></li>
<li><a href="#sec-5-2">5.2. 变量匹配</a></li>
<li><a href="#sec-5-3">5.3. 变量替换</a></li>
<li><a href="#sec-5-4">5.4. 变量赋值</a>
<ul>
<li><a href="#sec-5-4-1">5.4.1. 文件内容赋值</a></li>
<li><a href="#sec-5-4-2">5.4.2. 间接引用</a></li>
</ul>
</li>
<li><a href="#sec-5-5">5.5. 数组变量</a>
<ul>
<li><a href="#sec-5-5-1">5.5.1. 访问</a></li>
<li><a href="#sec-5-5-2">5.5.2. 赋值</a></li>
<li><a href="#sec-5-5-3">5.5.3. 删除</a></li>
<li><a href="#sec-5-5-4">5.5.4. 扩展</a></li>
<li><a href="#sec-5-5-5">5.5.5. 元素个数</a></li>
<li><a href="#sec-5-5-6">5.5.6. Bash 允许把变量当成数组来操作，即使这个变量没有明确地被声明为数组</a></li>
<li><a href="#sec-5-5-7">5.5.7. 对字符串使用数组操作</a></li>
</ul>
</li>
<li><a href="#sec-5-6">5.6. 特殊变量</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 字符串处理</a>
<ul>
<li><a href="#sec-6-1">6.1. 获取字符串变量长度</a></li>
<li><a href="#sec-6-2">6.2. 子串匹配</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1. <b>匹配字符串开头</b> 的子串长度</a></li>
<li><a href="#sec-6-2-2">6.2.2. 匹配字符串中子串第一次出现的位置</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3. 子串提取</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1. 正向提取子串</a></li>
<li><a href="#sec-6-3-2">6.3.2. 反向（从右边开始）提取子串</a></li>
<li><a href="#sec-6-3-3">6.3.3. 从 <b>开始位置</b> 提取 substring (substring 是正则表达式)</a></li>
<li><a href="#sec-6-3-4">6.3.4. 从 <b>结尾</b> 提取 substring (substring 是正则表达式)</a></li>
</ul>
</li>
<li><a href="#sec-6-4">6.4. 子串消除</a></li>
<li><a href="#sec-6-5">6.5. 子串替换</a></li>
<li><a href="#sec-6-6">6.6. 大小写转换</a></li>
</ul>
</li>
<li><a href="#sec-7">7. 参数处理</a>
<ul>
<li><a href="#sec-7-1">7.1. 获取最后一个参数</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 循环</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> for</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 基本用法</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">for</span> arg; <span style="color: #5f8700;">do</span>
    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">TODO</span>
<span style="color: #5f8700;">done</span> [ | <span style="color: #5f8700;">command</span> ]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> bash 风格</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">for</span> i<span style="color: #5f8700;"> in</span> {1..10}; <span style="color: #5f8700;">do</span>
    <span style="color: #5f8700;">echo</span> -n <span style="color: #00afaf;">"$i "</span>
<span style="color: #5f8700;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> c 风格</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">LIMIT</span>=10

<span style="color: #5f8700;">for</span> ((i = 1; i &lt;= LIMIT; i++)); <span style="color: #5f8700;">do</span>
    <span style="color: #5f8700;">echo</span> -n <span style="color: #00afaf;">"$i "</span>
<span style="color: #5f8700;">done</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">LIMIT</span>=10

<span style="color: #5f8700;">for</span> ((i = 1, j = 1; i &lt;= LIMIT; i++, j++)); <span style="color: #5f8700;">do</span>
    <span style="color: #5f8700;">echo</span> -n <span style="color: #00afaf;">"$i-$j "</span>
<span style="color: #5f8700;">done</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> while</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 基本用法</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">while </span><span style="color: #5f8700;">read</span> line; <span style="color: #5f8700;">do</span>
    <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">TODO</span>
<span style="color: #5f8700;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> c 风格</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-sh">(( i = 1 ))

<span style="color: #5f8700;">while</span> (( i &lt;= LIMIT )); <span style="color: #5f8700;">do</span>
    <span style="color: #5f8700;">echo</span> -n <span style="color: #00afaf;">"$i "</span>
    (( i += 1 ))
<span style="color: #5f8700;">done</span>
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> IFS</h3>
<div class="outline-text-3" id="text-1-3">
<p>
可以在循环内部设置 <code>$IFS</code> 变量，而不用把原始的 <code>$IFS</code> 保存到临时变量中
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">echo</span> <span style="color: #00afaf;">"List of all users:"</span>
<span style="color: #5f8700;">while</span> <span style="color: #0087ff;">IFS</span>=: read name passwd uid gid fullname ignore; <span style="color: #5f8700;">do</span>
    <span style="color: #5f8700;">echo</span> <span style="color: #00afaf;">"$name ($fullname)"</span>
<span style="color: #5f8700;">done</span> &lt;/etc/passwd
<span style="color: #5f8700;">echo</span> <span style="color: #00afaf;">"\$IFS still $IFS"</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> continue, break</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<code>continue</code> 命令可以 <b>带一个参数</b> ，不带参数的 <code>continue</code> 命令只会去掉本次循环的剩余代码，而 <code>continue N</code> 将会把 N 层循环的剩余代码都去掉。
</p>

<p>
<code>break</code> 命令 <b>可以带一个参数</b> ，一个不带参数的 <code>break</code> 命令只能退出最内层的循环，而 <code>break N</code> 可以退出 N 层循环。
</p>
</div>
</div>
