bash/bash.org
** case, select

#+BEGIN_SRC sh
  # Bash Menu Script Example

  PS3='Please enter your choice: '
  options=("Option 1" "Option 2" "Option 3" "Quit")
  select opt in "${options[@]}"
  do
      case $opt in
          "Option 1")
              echo "you chose choice 1"
              ;;
          "Option 2")
              echo "you chose choice 2"
              ;;
          "Option 3")
              echo "you chose choice 3"
              ;;
          "Quit")
              break # Add break statements wherever need the select loop to exit
              ;;
          *) echo invalid option;;
      esac
  done
#+END_SRC


** 带步进值的循环

 #+BEGIN_SRC sh
    for i in {0..100..3}; do
        echo $i
    done
 #+END_SRC


* 函数

- =return= 只能用在函数或被 =source= 的脚本中
- 函数如果在一行内定义，需要加分号： =hello() { true; }=
- 代码块 ={}= ，又被称为内部组，实际上是创建了一个匿名函数，与标准函数不同的是，在其中申明的变量， *对脚本其他部分的代码而言是可见的*

** 在 =if/then= 结构中定义函数

#+BEGIN_SRC sh
  if [[ "$USER" == root ]]; then
      greet() {
          echo hello
      }
  fi
#+END_SRC

** 函数指针

#+BEGIN_SRC sh
  declare -f fp
  fp=function_name
  $fp arg1 arg2
#+END_SRC


* 声明

- =declare= 和 =typeset= 命令两者是 *完全一样* 的

** 声明只读变量

=declare -r `Variable`= 等价于 =readonly `Variable`=

** 查看变量类型

=declare -p `Variable`=

** 声明整形变量

=declare -i `Variable`=

如果把一个变量指定为整形的话，即使没有 =expr= 或者 =let= 命令，也允许使用特定的算术运算

** 声明数组变量

=declare -a `Array`=

** 声明函数指针

=declare -f `[FunctionName]`=

如果不提供 FunctionName ，将会列出这个脚本之前定义的所有函数，若提供函数名，则给出这个函数的相关信息

** 限制变量作用域

#+BEGIN_SRC sh
  foo() {
      declare FOO="bar"
  }
  bar() {
      foo
      echo $FOO
  }
  bar  # output nothing
#+END_SRC


* 测试

** 测试文件类型

- =-e= :: 文件是否存在
- =-f= :: 文件是否存在且为文件（file）
- =-d= :: 文件是否存在且为目录（directory）
- =-b= :: 文件是否存在且为 block device
- =-c= :: 文件是否存在且为 character device
- =-S= :: 文件是否存在且为 Socket
- =-p= :: 文件是否存在且为 FIFO (pipe)
- =-L= :: 文件是否存在且为 link

** 测试文件权限

- =-r= :: 文件是否存在且具有可读权限
- =-w= :: 文件是否存在且具有可写权限
- =-x= :: 文件是否存在且具有可运行权限
- =-u= :: 文件是否存在且具有SUID权限
- =-g= :: 文件是否存在且具有SGID权限
- =-k= :: 文件是否存在且具有Sticky bit权限
- =-s= :: 文件是否存在且为非空白文件

** 文件比较

- =-nt= :: 判断 file1 是否比 file2 新
- =-ot= :: 判断 file1 是否比 file2 旧
- =-ef= :: 判断 file1 与 file2 是否为同一文件（两个文件是否均指向同一个 inode ）

** *整数* 比较

- =-eq= ::  equal
- =-ne= ::  not equal
- =-gt= ::  great than
- =-lt= ::  less than
- =-ge= ::  great than or equal
- =-le= ::  less than or equal


** 字符串比较

- =-z string= :: 若 string 为空字符串，则为 true  ( z 表示 zero )
- =-n string= :: 若 string 为空字符串，则为 false ( -n 可省略，n 表示 not empty )
- =str1 = str2= :: 若 str1 等于 str2 ，则为 true
- str1 != str2 :: 若 str1 等于 str2 ，则为 false


** 多重条件判定

- -a :: =test -r file -a -x file=
- -o :: =test -r file -o -x file=
- ! :: =test ! -x file=
- && :: 用于双括号结构中
- || :: 用于双括号结构中


** 双括号和单括号中的行为比较

#+BEGIN_SRC sh
  [[ $var == z* ]]   ## 如果 var 以 z 开头，则结果为真

  [ $var == z* ]     ## 如果 var 为 zoo，当前目录下有且只有一个文件名为 zoo，则结果为真，
                     ## 此处，z* 将文件名扩展了

  [[ $var == "z*" ]] ## 如果 var 和 "z*" 在字面上完全相等，则结果为真

  [ $var == "z*" ]   ## 同上
#+END_SRC

** c 风格

#+BEGIN_SRC sh
  (( a < 16 )) && echo "true"
#+END_SRC


* 变量

** 变量检查

#+BEGIN_SRC sh
  : ${variable?error_msg} ## 一种检查变量是否设置的方法，
                          ## 若没有设置，则error_msg会输出到std_err中
#+END_SRC
