bash/bash.html


<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> case, select</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">Bash Menu Script Example</span>

<span style="color: #0087ff;">PS3</span>=<span style="color: #00afaf;">'Please enter your choice: '</span>
<span style="color: #0087ff;">options</span>=(<span style="color: #00afaf;">"Option 1"</span> <span style="color: #00afaf;">"Option 2"</span> <span style="color: #00afaf;">"Option 3"</span> <span style="color: #00afaf;">"Quit"</span>)
<span style="color: #5f8700;">select</span> opt<span style="color: #5f8700;"> in</span> <span style="color: #00afaf;">"${options[@]}"</span>
<span style="color: #5f8700;">do</span>
    <span style="color: #5f8700;">case</span> $<span style="color: #0087ff;">opt</span><span style="color: #5f8700;"> in</span>
        <span style="color: #00afaf;">"Option 1"</span>)
            <span style="color: #5f8700;">echo</span> <span style="color: #00afaf;">"you chose choice 1"</span>
            ;;
        <span style="color: #00afaf;">"Option 2"</span>)
            <span style="color: #5f8700;">echo</span> <span style="color: #00afaf;">"you chose choice 2"</span>
            ;;
        <span style="color: #00afaf;">"Option 3"</span>)
            <span style="color: #5f8700;">echo</span> <span style="color: #00afaf;">"you chose choice 3"</span>
            ;;
        <span style="color: #00afaf;">"Quit"</span>)
            <span style="color: #5f8700;">break</span> <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">Add break statements wherever need the select loop to exit</span>
            ;;
        *) <span style="color: #5f8700;">echo</span> invalid option;;
    <span style="color: #5f8700;">esac</span>
<span style="color: #5f8700;">done</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 带步进值的循环</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">for</span> i<span style="color: #5f8700;"> in</span> {0..100..3}; <span style="color: #5f8700;">do</span>
    <span style="color: #5f8700;">echo</span> $<span style="color: #0087ff;">i</span>
<span style="color: #5f8700;">done</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 函数</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>return</code> 只能用在函数或被 <code>source</code> 的脚本中
</li>
<li>函数如果在一行内定义，需要加分号： <code>hello() { true; }</code>
</li>
<li>代码块 <code>{}</code> ，又被称为内部组，实际上是创建了一个匿名函数，与标准函数不同的是，在其中申明的变量， <b>对脚本其他部分的代码而言是可见的</b>
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 在 <code>if/then</code> 结构中定义函数</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">if</span> [[ <span style="color: #00afaf;">"$USER"</span> == root ]]; <span style="color: #5f8700;">then</span>
    greet() {
        <span style="color: #5f8700;">echo</span> hello
    }
<span style="color: #5f8700;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 函数指针</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">declare</span> -f fp
<span style="color: #0087ff;">fp</span>=function_name
$<span style="color: #0087ff;">fp</span> arg1 arg2
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 声明</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>declare</code> 和 <code>typeset</code> 命令两者是 <b>完全一样</b> 的
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 声明只读变量</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>declare -r `Variable`</code> 等价于 <code>readonly `Variable`</code>
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 查看变量类型</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>declare -p `Variable`</code>
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 声明整形变量</h3>
<div class="outline-text-3" id="text-3-3">
<p>
<code>declare -i `Variable`</code>
</p>

<p>
如果把一个变量指定为整形的话，即使没有 <code>expr</code> 或者 <code>let</code> 命令，也允许使用特定的算术运算
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 声明数组变量</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<code>declare -a `Array`</code>
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 声明函数指针</h3>
<div class="outline-text-3" id="text-3-5">
<p>
<code>declare -f `[FunctionName]`</code>
</p>

<p>
如果不提供 FunctionName ，将会列出这个脚本之前定义的所有函数，若提供函数名，则给出这个函数的相关信息
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 限制变量作用域</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">foo</span>() {
    <span style="color: #5f8700;">declare</span> <span style="color: #0087ff;">FOO</span>=<span style="color: #00afaf;">"bar"</span>
}
<span style="color: #0087ff;">bar</span>() {
    foo
    <span style="color: #5f8700;">echo</span> $<span style="color: #0087ff;">FOO</span>
}
bar  <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">output nothing</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 测试</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 测试文件类型</h3>
<div class="outline-text-3" id="text-4-1">
<dl class="org-dl">
<dt> <code>-e</code> </dt><dd>文件是否存在
</dd>
<dt> <code>-f</code> </dt><dd>文件是否存在且为文件（file）
</dd>
<dt> <code>-d</code> </dt><dd>文件是否存在且为目录（directory）
</dd>
<dt> <code>-b</code> </dt><dd>文件是否存在且为 block device
</dd>
<dt> <code>-c</code> </dt><dd>文件是否存在且为 character device
</dd>
<dt> <code>-S</code> </dt><dd>文件是否存在且为 Socket
</dd>
<dt> <code>-p</code> </dt><dd>文件是否存在且为 FIFO (pipe)
</dd>
<dt> <code>-L</code> </dt><dd>文件是否存在且为 link
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> 测试文件权限</h3>
<div class="outline-text-3" id="text-4-2">
<dl class="org-dl">
<dt> <code>-r</code> </dt><dd>文件是否存在且具有可读权限
</dd>
<dt> <code>-w</code> </dt><dd>文件是否存在且具有可写权限
</dd>
<dt> <code>-x</code> </dt><dd>文件是否存在且具有可运行权限
</dd>
<dt> <code>-u</code> </dt><dd>文件是否存在且具有SUID权限
</dd>
<dt> <code>-g</code> </dt><dd>文件是否存在且具有SGID权限
</dd>
<dt> <code>-k</code> </dt><dd>文件是否存在且具有Sticky bit权限
</dd>
<dt> <code>-s</code> </dt><dd>文件是否存在且为非空白文件
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 文件比较</h3>
<div class="outline-text-3" id="text-4-3">
<dl class="org-dl">
<dt> <code>-nt</code> </dt><dd>判断 file1 是否比 file2 新
</dd>
<dt> <code>-ot</code> </dt><dd>判断 file1 是否比 file2 旧
</dd>
<dt> <code>-ef</code> </dt><dd>判断 file1 与 file2 是否为同一文件（两个文件是否均指向同一个 inode ）
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <b>整数</b> 比较</h3>
<div class="outline-text-3" id="text-4-4">
<dl class="org-dl">
<dt> <code>-eq</code> </dt><dd>equal
</dd>
<dt> <code>-ne</code> </dt><dd>not equal
</dd>
<dt> <code>-gt</code> </dt><dd>great than
</dd>
<dt> <code>-lt</code> </dt><dd>less than
</dd>
<dt> <code>-ge</code> </dt><dd>great than or equal
</dd>
<dt> <code>-le</code> </dt><dd>less than or equal
</dd>
</dl>
</div>
</div>


<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 字符串比较</h3>
<div class="outline-text-3" id="text-4-5">
<dl class="org-dl">
<dt> <code>-z string</code> </dt><dd>若 string 为空字符串，则为 true  ( z 表示 zero )
</dd>
<dt> <code>-n string</code> </dt><dd>若 string 为空字符串，则为 false ( -n 可省略，n 表示 not empty )
</dd>
<dt> <code>str1 = str2</code> </dt><dd>若 str1 等于 str2 ，则为 true
</dd>
<dt> str1 != str2 </dt><dd>若 str1 等于 str2 ，则为 false
</dd>
</dl>
</div>
</div>


<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> 多重条件判定</h3>
<div class="outline-text-3" id="text-4-6">
<dl class="org-dl">
<dt> -a </dt><dd><code>test -r file -a -x file</code>
</dd>
<dt> -o </dt><dd><code>test -r file -o -x file</code>
</dd>
<dt> ! </dt><dd><code>test ! -x file</code>
</dd>
<dt> &amp;&amp; </dt><dd>用于双括号结构中
</dd>
<dt> || </dt><dd>用于双括号结构中
</dd>
</dl>
</div>
</div>


<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> 双括号和单括号中的行为比较</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">

<pre class="src src-sh">[[ $<span style="color: #0087ff;">var</span> == z* ]]   <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#22914;&#26524; var &#20197; z &#24320;&#22836;&#65292;&#21017;&#32467;&#26524;&#20026;&#30495;</span>

[ $<span style="color: #0087ff;">var</span> == z* ]     <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#22914;&#26524; var &#20026; zoo&#65292;&#24403;&#21069;&#30446;&#24405;&#19979;&#26377;&#19988;&#21482;&#26377;&#19968;&#20010;&#25991;&#20214;&#21517;&#20026; zoo&#65292;&#21017;&#32467;&#26524;&#20026;&#30495;&#65292;</span>
                   <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#27492;&#22788;&#65292;z* &#23558;&#25991;&#20214;&#21517;&#25193;&#23637;&#20102;</span>

[[ $<span style="color: #0087ff;">var</span> == <span style="color: #00afaf;">"z*"</span> ]] <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#22914;&#26524; var &#21644; "z*" &#22312;&#23383;&#38754;&#19978;&#23436;&#20840;&#30456;&#31561;&#65292;&#21017;&#32467;&#26524;&#20026;&#30495;</span>

[ $<span style="color: #0087ff;">var</span> == <span style="color: #00afaf;">"z*"</span> ]   <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21516;&#19978;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> c 风格</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">

<pre class="src src-sh">(( a &lt; 16 )) &amp;&amp; <span style="color: #5f8700;">echo</span> <span style="color: #00afaf;">"true"</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 变量</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 变量检查</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-sh">: ${<span style="color: #0087ff;">variable</span>?error_msg} <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#19968;&#31181;&#26816;&#26597;&#21464;&#37327;&#26159;&#21542;&#35774;&#32622;&#30340;&#26041;&#27861;&#65292;</span>
                        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#33509;&#27809;&#26377;&#35774;&#32622;&#65292;&#21017;error_msg&#20250;&#36755;&#20986;&#21040;std_err&#20013;</span>
</pre>
</div>
</div>
</div>
