bash/bash.org
** 变量匹配

=${!varprefix*}= 或 =${!varprefix@}= 用于匹配所有之前声明过的，并且以 =varprefix= 开头的变量

#+BEGIN_SRC sh
  xyz23=whatever
  xyz24=
  a=${!xyz*}                     ## 展开所有以"xyz"开头的，并且之前声明过的变量名
  echo "a = $a"                  ## a = xyz23 xyz24

#+END_SRC

** 变量替换

|------------------+-----------------------+-------------------------+---------------------------|
| str              | =not set=             | =empty string=          | =set & not empty string=  |
|------------------+-----------------------+-------------------------+---------------------------|
| var=${str-expr}  | var=expr              | var=""                  | var=$str                  |
| var=${str:-expr} | var=expr              | var=expr                | var=$str                  |
| var=${str+expr}  | var=""                | var=expr                | var=expr                  |
| var=${str:+expr} | var=""                | var=""                  | var=expr                  |
| var=${str=expr}  | str=expr; var=expr    | str =unchanged=; var="" | str =unchanged=; var=$str |
| var=${str:=expr} | str=expr; var=expr    | str=expr; var=expr      | str =unchanged=; var=$str |
| var=${str?expr}  | output expr to stderr | var=""                  | var=$str                  |
| var=${str:?expr} | output expr to stderr | output expr to stderr   | var=$str                  |
|------------------+-----------------------+-------------------------+---------------------------|

** 变量赋值

*** 文件内容赋值

#+BEGIN_SRC sh
  var=$( <FileName )
#+END_SRC

*** 间接引用

#+BEGIN_SRC sh
  eval var1=\$$var2
#+END_SRC

等效于：

#+BEGIN_SRC sh
  var1=${!var2}
#+END_SRC

** 数组变量

*** 访问

#+BEGIN_SRC sh
  ${array[Idx]}

  echo ${array[*]} # 打印所有数组
#+END_SRC

*** 赋值

#+BEGIN_SRC sh
  arr=( 1 2 3 4 5 )

  arr=( [Idx1]=v1 [Idx2]=v2 )
#+END_SRC

*** 删除

#+BEGIN_SRC sh
  unset array[2]      ## 删除数组第3个元素
  unset array         ## 删除整个数组
#+END_SRC

*** 扩展

#+BEGIN_SRC sh
  new_array+=( 1 2 3 )
  new_array=( "${old_array[@]}" new_element )
  array[${#array[*]}]=new_element

  new_array="${old_array[@]}"  ## 复制数组(但是如果在*缺项*数组中使用的话，将会失败，新数组中的某个元素会没被赋值)
                               ## 建议使用 new=( ${old[*]} )
#+END_SRC


*** 元素个数

#+BEGIN_SRC sh
  ${#array[*]}
  ${#array[@]}


#+END_SRC

*注意* ：

=${#array}= ：表示数组中 *第一个元素的长度*

*** Bash 允许把变量当成数组来操作，即使这个变量没有明确地被声明为数组

#+BEGIN_SRC sh
  string=abcABC123ABCabc
  echo ${string[@]}       ## abcABC123ABCabc
  echo ${string[*]}       ## abcABC123ABCabc
  echo ${string[0]}       ## abcABC123ABCabc
  echo ${string[1]}       ## 没有输出
  echo ${#string[@]}      ## 1
                          ## 数组中只有一个元素，就是这个字符串本身
#+END_SRC

*** 对字符串使用数组操作

#+BEGIN_SRC sh
  array=( zero one two three four fiive )
  ${array[0]}         ## zero
  ${array}            ## 同上
  ${array:1}          ## ero
  $(array[0]:1}       ## 同上
  ${#array[0]}        ## 等同于 ${#array}
  ${array[@]:0}       ## 所有元素
  ${array[@]:1}       ## element[0] 后面的所有元素
  ${array[@]:1:2}
  ${array[@]#f*r}
  ${array[@]%%t*e}
  ${array[@]/#fi/XY}
  ${array[@]/%ve/ZZ}  ## 这类操作其实都是对每个 element 做轮询，
                      ## 而不是针对整个 array，
                      ## 如 ${array[*]#*ree}，只是删除 three
#+END_SRC

