bash/bash.html
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 变量匹配</h3>
<div class="outline-text-3" id="text-5-2">
<p>
<code>${!varprefix*}</code> 或 <code>${!varprefix@}</code> 用于匹配所有之前声明过的，并且以 <code>varprefix</code> 开头的变量
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">xyz23</span>=whatever
<span style="color: #0087ff;">xyz24</span>=
<span style="color: #0087ff;">a</span>=${<span style="color: #0087ff;">!</span>xyz*}                     <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#23637;&#24320;&#25152;&#26377;&#20197;"xyz"&#24320;&#22836;&#30340;&#65292;&#24182;&#19988;&#20043;&#21069;&#22768;&#26126;&#36807;&#30340;&#21464;&#37327;&#21517;</span>
<span style="color: #5f8700;">echo</span> <span style="color: #00afaf;">"a = $a"</span>                  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">a = xyz23 xyz24</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 变量替换</h3>
<div class="outline-text-3" id="text-5-3">
<table>


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="left">str</th>
<th scope="col" class="left"><code>not set</code></th>
<th scope="col" class="left"><code>empty string</code></th>
<th scope="col" class="left"><code>set &amp; not empty string</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">var=${str-expr}</td>
<td class="left">var=expr</td>
<td class="left">var=""</td>
<td class="left">var=$str</td>
</tr>

<tr>
<td class="left">var=${str:-expr}</td>
<td class="left">var=expr</td>
<td class="left">var=expr</td>
<td class="left">var=$str</td>
</tr>

<tr>
<td class="left">var=${str+expr}</td>
<td class="left">var=""</td>
<td class="left">var=expr</td>
<td class="left">var=expr</td>
</tr>

<tr>
<td class="left">var=${str:+expr}</td>
<td class="left">var=""</td>
<td class="left">var=""</td>
<td class="left">var=expr</td>
</tr>

<tr>
<td class="left">var=${str=expr}</td>
<td class="left">str=expr; var=expr</td>
<td class="left">str <code>unchanged</code>; var=""</td>
<td class="left">str <code>unchanged</code>; var=$str</td>
</tr>

<tr>
<td class="left">var=${str:=expr}</td>
<td class="left">str=expr; var=expr</td>
<td class="left">str=expr; var=expr</td>
<td class="left">str <code>unchanged</code>; var=$str</td>
</tr>

<tr>
<td class="left">var=${str?expr}</td>
<td class="left">output expr to stderr</td>
<td class="left">var=""</td>
<td class="left">var=$str</td>
</tr>

<tr>
<td class="left">var=${str:?expr}</td>
<td class="left">output expr to stderr</td>
<td class="left">output expr to stderr</td>
<td class="left">var=$str</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 变量赋值</h3>
<div class="outline-text-3" id="text-5-4">
</div><div id="outline-container-sec-5-4-1" class="outline-4">
<h4 id="sec-5-4-1"><span class="section-number-4">5.4.1</span> 文件内容赋值</h4>
<div class="outline-text-4" id="text-5-4-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">var</span>=$( &lt;FileName )
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-4-2" class="outline-4">
<h4 id="sec-5-4-2"><span class="section-number-4">5.4.2</span> 间接引用</h4>
<div class="outline-text-4" id="text-5-4-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">eval</span> <span style="color: #0087ff;">var1</span>=<span style="color: #00afaf;">\$</span><span style="color: #0087ff;">$var2</span>
</pre>
</div>

<p>
等效于：
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">var1</span>=${<span style="color: #0087ff;">!</span>var2}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 数组变量</h3>
<div class="outline-text-3" id="text-5-5">
</div><div id="outline-container-sec-5-5-1" class="outline-4">
<h4 id="sec-5-5-1"><span class="section-number-4">5.5.1</span> 访问</h4>
<div class="outline-text-4" id="text-5-5-1">
<div class="org-src-container">

<pre class="src src-sh">${<span style="color: #0087ff;">array</span>[Idx]}

<span style="color: #5f8700;">echo</span> ${<span style="color: #0087ff;">array</span>[*]} <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#25171;&#21360;&#25152;&#26377;&#25968;&#32452;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-5-2" class="outline-4">
<h4 id="sec-5-5-2"><span class="section-number-4">5.5.2</span> 赋值</h4>
<div class="outline-text-4" id="text-5-5-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">arr</span>=( 1 2 3 4 5 )

<span style="color: #0087ff;">arr</span>=( [Idx1]=v1 [Idx2]=v2 )
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-5-3" class="outline-4">
<h4 id="sec-5-5-3"><span class="section-number-4">5.5.3</span> 删除</h4>
<div class="outline-text-4" id="text-5-5-3">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">unset</span> array[2]      <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21024;&#38500;&#25968;&#32452;&#31532;3&#20010;&#20803;&#32032;</span>
<span style="color: #5f8700;">unset</span> array         <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21024;&#38500;&#25972;&#20010;&#25968;&#32452;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-5-4" class="outline-4">
<h4 id="sec-5-5-4"><span class="section-number-4">5.5.4</span> 扩展</h4>
<div class="outline-text-4" id="text-5-5-4">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">new_array</span>+=( 1 2 3 )
<span style="color: #0087ff;">new_array</span>=( <span style="color: #00afaf;">"${old_array[@]}"</span> new_element )
<span style="color: #0087ff;">array</span>[${#<span style="color: #0087ff;">array</span>[*]}]=new_element

<span style="color: #0087ff;">new_array</span>=<span style="color: #00afaf;">"${old_array[@]}"</span>  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#22797;&#21046;&#25968;&#32452;(&#20294;&#26159;&#22914;&#26524;&#22312;*&#32570;&#39033;*&#25968;&#32452;&#20013;&#20351;&#29992;&#30340;&#35805;&#65292;&#23558;&#20250;&#22833;&#36133;&#65292;&#26032;&#25968;&#32452;&#20013;&#30340;&#26576;&#20010;&#20803;&#32032;&#20250;&#27809;&#34987;&#36171;&#20540;)</span>
                             <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#24314;&#35758;&#20351;&#29992; new=( ${old[*]} )</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-5-5-5" class="outline-4">
<h4 id="sec-5-5-5"><span class="section-number-4">5.5.5</span> 元素个数</h4>
<div class="outline-text-4" id="text-5-5-5">
<div class="org-src-container">

<pre class="src src-sh">${#<span style="color: #0087ff;">array</span>[*]}
${#<span style="color: #0087ff;">array</span>[@]}
</pre>
</div>

<p>
<b>注意</b> ：
</p>

<p>
<code>${#array}</code> ：表示数组中 <b>第一个元素的长度</b>
</p>
</div>
</div>

<div id="outline-container-sec-5-5-6" class="outline-4">
<h4 id="sec-5-5-6"><span class="section-number-4">5.5.6</span> Bash 允许把变量当成数组来操作，即使这个变量没有明确地被声明为数组</h4>
<div class="outline-text-4" id="text-5-5-6">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">string</span>=abcABC123ABCabc
<span style="color: #5f8700;">echo</span> ${<span style="color: #0087ff;">string</span>[@]}       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">abcABC123ABCabc</span>
<span style="color: #5f8700;">echo</span> ${<span style="color: #0087ff;">string</span>[*]}       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">abcABC123ABCabc</span>
<span style="color: #5f8700;">echo</span> ${<span style="color: #0087ff;">string</span>[0]}       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">abcABC123ABCabc</span>
<span style="color: #5f8700;">echo</span> ${<span style="color: #0087ff;">string</span>[1]}       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#27809;&#26377;&#36755;&#20986;</span>
<span style="color: #5f8700;">echo</span> ${#<span style="color: #0087ff;">string</span>[@]}      <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">1</span>
                        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#25968;&#32452;&#20013;&#21482;&#26377;&#19968;&#20010;&#20803;&#32032;&#65292;&#23601;&#26159;&#36825;&#20010;&#23383;&#31526;&#20018;&#26412;&#36523;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-5-7" class="outline-4">
<h4 id="sec-5-5-7"><span class="section-number-4">5.5.7</span> 对字符串使用数组操作</h4>
<div class="outline-text-4" id="text-5-5-7">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">array</span>=( zero one two three four fiive )
${<span style="color: #0087ff;">array</span>[0]}         <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">zero</span>
${<span style="color: #0087ff;">array</span>}            <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21516;&#19978;</span>
${<span style="color: #0087ff;">array</span>:1}          <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">ero</span>
$(<span style="color: #fa8072;">array</span>[0]:1}       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21516;&#19978;</span>
${#<span style="color: #0087ff;">array</span>[0]}        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#31561;&#21516;&#20110; ${#array}</span>
${<span style="color: #0087ff;">array</span>[@]:0}       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#25152;&#26377;&#20803;&#32032;</span>
${<span style="color: #0087ff;">array</span>[@]:1}       <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">element[0] &#21518;&#38754;&#30340;&#25152;&#26377;&#20803;&#32032;</span>
${<span style="color: #0087ff;">array</span>[@]:1:2}
${<span style="color: #0087ff;">array</span>[@]#f*r}
${<span style="color: #0087ff;">array</span>[@]%%t*e}
${<span style="color: #0087ff;">array</span>[@]/#fi/XY}
${<span style="color: #0087ff;">array</span>[@]/%ve/ZZ}  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#36825;&#31867;&#25805;&#20316;&#20854;&#23454;&#37117;&#26159;&#23545;&#27599;&#20010; element &#20570;&#36718;&#35810;&#65292;</span>
                    <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#32780;&#19981;&#26159;&#38024;&#23545;&#25972;&#20010; array&#65292;</span>
                    <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#22914; ${array[*]#*ree}&#65292;&#21482;&#26159;&#21024;&#38500; three</span>
</pre>
</div>
</div>
</div>
</div>
