bash/bash.org
** 特殊变量

#+BEGIN_SRC sh
  $DIRSTACK ## 内建数组，记录目录栈
  $#        ## 参数数量
  $$        ## shell进程ID
  $-        ## 当前shell的选项标识
  $_        ## 上一条命令的参数
  $!        ## 上一个在后台运行的作业的pid
  $@        ## "$@" 等价于 "$1" "$2" "$3",
            ## 按照空格来分隔，就算IFS用别的字符，"$@"还是按照空格来判断参数的个数,
            ## $@ 也可以用来获取传递给脚本的输入，cat $@ 可以接受从 stdin 传递给脚本的输入，
            ## 也可以接受从参数中指定的文件中传递给脚本的输入,
            ## *$@ 与 $* 中的参数只有在被双引号引用起来的时候才会不同
  ${#*}     ## 位置参数的个数
  ${#@}     ## 同上
  $RANDOM   ## 0 - 32767
#+END_SRC

* 字符串处理

** 获取字符串变量长度

#+BEGIN_SRC sh
  ${#var}
  expr "$var" : '.*'
  expr length $var
#+END_SRC


** 子串匹配

*** *匹配字符串开头* 的子串长度

#+BEGIN_SRC sh
  expr match "$string" '$regex'
  expr "$string" : '$regex'
  stringZ=abcABC123ABCabc
  echo `expr match "$stringZ" 'abc[A-Z]*.2'`
  echo `expr "$stringZ" : 'abc[A-Z]*.2'`
#+END_SRC

*** 匹配字符串中子串第一次出现的位置

#+BEGIN_SRC sh
  expr index $string $regex
  stringZ=abcABC123ABCabc
  echo `expr index "$stringZ" C12` # 6
  echo `expr index "$stringZ" 1c`  # 3, 'c' (in #3 position) matches before '1'
#+END_SRC

** 子串提取

*** 正向提取子串

#+BEGIN_SRC sh
  ${string:position}

  ${string:position:length}  # 在 $string 中从位置 $position 开始提取子串
                             # 如果 $string 是 * 或 @ ，那么将会从位置 $position 开始提取位置参数
#+END_SRC

*** 反向（从右边开始）提取子串

#+BEGIN_SRC sh
  echo ${stringZ:-4}   ## 错误语法，结果为提取了整个字符串
  echo ${stringZ:(-4)} ## 正确语法
  echo ${stringZ: -4}  ## 正确语法
#+END_SRC

*** 从 *开始位置* 提取 substring (substring 是正则表达式)

#+BEGIN_SRC sh
  stringZ=abcABC123ABCabc

  echo `expr match "$stringZ" '\(.[b-c]*[A-Z]..[0-9]\)'` # abcABC1
  echo `expr "$stringZ" : '\(.[b-c]*[A-Z]..[0-9]\)'`
  echo `expr "$stringZ" : '\(.......\)'`
#+END_SRC

*** 从 *结尾* 提取 substring (substring 是正则表达式)

#+BEGIN_SRC sh
  stringZ=abcABC123ABCabc

  echo `expr match "$stringZ" '.*\([A-C][A-C][A-C][a-c]*\)'`
  echo `expr "$stringZ" : '.*\(......\)'`
#+END_SRC

** 子串消除

#+BEGIN_SRC sh
  ${string#substring}  ## 从$string的**开头位置**截掉最短匹配的$substring
  ${string##substring} ## 从$string的**开头位置**截掉最长匹配的$substring
  ${string%substring}  ## 从$string的**结尾位置**截掉最短匹配的$substring
  ${string%%substring} ## 从$string的**结尾位置**截掉最长匹配的$substring
#+END_SRC


** 子串替换

#+BEGIN_SRC sh
  ${string/substring/replacement}  ## 使用$replacement来替换**第一个匹配**的$substring
  ${string//substring/replacement} ## 使用$replacement来替换**所有匹配**的$substring
  ## 如果$substring匹配$string的**开头部分**，那么就用$replacement替换$substring
  ${string/#substring/replacement}
  ## 如果$substring匹配$string的**结尾部分**，那么就用$replacement替换$substring
  ${string/%substring/replacement}
#+END_SRC

** 大小写转换

#+BEGIN_SRC sh
  echo ${var^^}
  echo ${var,,}
  tr '[:lower:]' '[:upper:]'
#+END_SRC

* 参数处理

