bash/bash.html

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> 特殊变量</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">

<pre class="src src-sh">$<span style="color: #0087ff;">DIRSTACK</span> <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#20869;&#24314;&#25968;&#32452;&#65292;&#35760;&#24405;&#30446;&#24405;&#26632;</span>
$<span style="color: #0087ff;">#</span>        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21442;&#25968;&#25968;&#37327;</span>
$<span style="color: #0087ff;">$</span>        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">shell&#36827;&#31243;ID</span>
$<span style="color: #0087ff;">-</span>        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#24403;&#21069;shell&#30340;&#36873;&#39033;&#26631;&#35782;</span>
$<span style="color: #0087ff;">_</span>        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#19978;&#19968;&#26465;&#21629;&#20196;&#30340;&#21442;&#25968;</span>
$<span style="color: #0087ff;">!</span>        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#19978;&#19968;&#20010;&#22312;&#21518;&#21488;&#36816;&#34892;&#30340;&#20316;&#19994;&#30340;pid</span>
$<span style="color: #0087ff;">@</span>        <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">"$@" &#31561;&#20215;&#20110; "$1" "$2" "$3",</span>
          <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#25353;&#29031;&#31354;&#26684;&#26469;&#20998;&#38548;&#65292;&#23601;&#31639;IFS&#29992;&#21035;&#30340;&#23383;&#31526;&#65292;"$@"&#36824;&#26159;&#25353;&#29031;&#31354;&#26684;&#26469;&#21028;&#26029;&#21442;&#25968;&#30340;&#20010;&#25968;,</span>
          <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">$@ &#20063;&#21487;&#20197;&#29992;&#26469;&#33719;&#21462;&#20256;&#36882;&#32473;&#33050;&#26412;&#30340;&#36755;&#20837;&#65292;cat $@ &#21487;&#20197;&#25509;&#21463;&#20174; stdin &#20256;&#36882;&#32473;&#33050;&#26412;&#30340;&#36755;&#20837;&#65292;</span>
          <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#20063;&#21487;&#20197;&#25509;&#21463;&#20174;&#21442;&#25968;&#20013;&#25351;&#23450;&#30340;&#25991;&#20214;&#20013;&#20256;&#36882;&#32473;&#33050;&#26412;&#30340;&#36755;&#20837;,</span>
          <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">*$@ &#19982; $* &#20013;&#30340;&#21442;&#25968;&#21482;&#26377;&#22312;&#34987;&#21452;&#24341;&#21495;&#24341;&#29992;&#36215;&#26469;&#30340;&#26102;&#20505;&#25165;&#20250;&#19981;&#21516;</span>
${<span style="color: #0087ff;">#</span>*}     <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#20301;&#32622;&#21442;&#25968;&#30340;&#20010;&#25968;</span>
${#<span style="color: #0087ff;">@</span>}     <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#21516;&#19978;</span>
$<span style="color: #0087ff;">RANDOM</span>   <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">0 - 32767</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 字符串处理</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 获取字符串变量长度</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-sh">${#<span style="color: #0087ff;">var</span>}
expr <span style="color: #00afaf;">"$var"</span> : <span style="color: #00afaf;">'.*'</span>
expr length $<span style="color: #0087ff;">var</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 子串匹配</h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> <b>匹配字符串开头</b> 的子串长度</h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">

<pre class="src src-sh">expr match <span style="color: #00afaf;">"$string"</span> <span style="color: #00afaf;">'$regex'</span>
expr <span style="color: #00afaf;">"$string"</span> : <span style="color: #00afaf;">'$regex'</span>
<span style="color: #0087ff;">stringZ</span>=abcABC123ABCabc
<span style="color: #5f8700;">echo</span> <span style="color: #fa8072;">`expr match "$stringZ" 'abc[A-Z]*.2'`</span>
<span style="color: #5f8700;">echo</span> <span style="color: #fa8072;">`expr "$stringZ" : 'abc[A-Z]*.2'`</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> 匹配字符串中子串第一次出现的位置</h4>
<div class="outline-text-4" id="text-6-2-2">
<div class="org-src-container">

<pre class="src src-sh">expr index $<span style="color: #0087ff;">string</span> $<span style="color: #0087ff;">regex</span>
<span style="color: #0087ff;">stringZ</span>=abcABC123ABCabc
<span style="color: #5f8700;">echo</span> <span style="color: #fa8072;">`expr index "$stringZ" C12`</span> <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">6</span>
<span style="color: #5f8700;">echo</span> <span style="color: #fa8072;">`expr index "$stringZ" 1c`</span>  <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">3, 'c' (in #3 position) matches before '1'</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 子串提取</h3>
<div class="outline-text-3" id="text-6-3">
</div><div id="outline-container-sec-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> 正向提取子串</h4>
<div class="outline-text-4" id="text-6-3-1">
<div class="org-src-container">

<pre class="src src-sh">${<span style="color: #0087ff;">string</span>:position}

${<span style="color: #0087ff;">string</span>:position:length}  <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#22312; $string &#20013;&#20174;&#20301;&#32622; $position &#24320;&#22987;&#25552;&#21462;&#23376;&#20018;</span>
                           <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#22914;&#26524; $string &#26159; * &#25110; @ &#65292;&#37027;&#20040;&#23558;&#20250;&#20174;&#20301;&#32622; $position &#24320;&#22987;&#25552;&#21462;&#20301;&#32622;&#21442;&#25968;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-3-2" class="outline-4">
<h4 id="sec-6-3-2"><span class="section-number-4">6.3.2</span> 反向（从右边开始）提取子串</h4>
<div class="outline-text-4" id="text-6-3-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">echo</span> ${<span style="color: #0087ff;">stringZ</span>:-4}   <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#38169;&#35823;&#35821;&#27861;&#65292;&#32467;&#26524;&#20026;&#25552;&#21462;&#20102;&#25972;&#20010;&#23383;&#31526;&#20018;</span>
<span style="color: #5f8700;">echo</span> ${<span style="color: #0087ff;">stringZ</span>:(-4)} <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#27491;&#30830;&#35821;&#27861;</span>
<span style="color: #5f8700;">echo</span> ${<span style="color: #0087ff;">stringZ</span>: -4}  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#27491;&#30830;&#35821;&#27861;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-3-3" class="outline-4">
<h4 id="sec-6-3-3"><span class="section-number-4">6.3.3</span> 从 <b>开始位置</b> 提取 substring (substring 是正则表达式)</h4>
<div class="outline-text-4" id="text-6-3-3">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">stringZ</span>=abcABC123ABCabc

<span style="color: #5f8700;">echo</span> <span style="color: #fa8072;">`expr match "$stringZ" '\(.[b-c]*[A-Z]..[0-9]\)'`</span> <span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">abcABC1</span>
<span style="color: #5f8700;">echo</span> <span style="color: #fa8072;">`expr "$stringZ" : '\(.[b-c]*[A-Z]..[0-9]\)'`</span>
<span style="color: #5f8700;">echo</span> <span style="color: #fa8072;">`expr "$stringZ" : '\(.......\)'`</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-3-4" class="outline-4">
<h4 id="sec-6-3-4"><span class="section-number-4">6.3.4</span> 从 <b>结尾</b> 提取 substring (substring 是正则表达式)</h4>
<div class="outline-text-4" id="text-6-3-4">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #0087ff;">stringZ</span>=abcABC123ABCabc

<span style="color: #5f8700;">echo</span> <span style="color: #fa8072;">`expr match "$stringZ" '.*\([A-C][A-C][A-C][a-c]*\)'`</span>
<span style="color: #5f8700;">echo</span> <span style="color: #fa8072;">`expr "$stringZ" : '.*\(......\)'`</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> 子串消除</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">

<pre class="src src-sh">${<span style="color: #0087ff;">string</span>#substring}  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#20174;$string&#30340;**&#24320;&#22836;&#20301;&#32622;**&#25130;&#25481;&#26368;&#30701;&#21305;&#37197;&#30340;$substring</span>
${<span style="color: #0087ff;">string</span>##substring} <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#20174;$string&#30340;**&#24320;&#22836;&#20301;&#32622;**&#25130;&#25481;&#26368;&#38271;&#21305;&#37197;&#30340;$substring</span>
${<span style="color: #0087ff;">string</span>%substring}  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#20174;$string&#30340;**&#32467;&#23614;&#20301;&#32622;**&#25130;&#25481;&#26368;&#30701;&#21305;&#37197;&#30340;$substring</span>
${<span style="color: #0087ff;">string</span>%%substring} <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#20174;$string&#30340;**&#32467;&#23614;&#20301;&#32622;**&#25130;&#25481;&#26368;&#38271;&#21305;&#37197;&#30340;$substring</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> 子串替换</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">

<pre class="src src-sh">${<span style="color: #0087ff;">string</span>/substring/replacement}  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#20351;&#29992;$replacement&#26469;&#26367;&#25442;**&#31532;&#19968;&#20010;&#21305;&#37197;**&#30340;$substring</span>
${<span style="color: #0087ff;">string</span>//substring/replacement} <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#20351;&#29992;$replacement&#26469;&#26367;&#25442;**&#25152;&#26377;&#21305;&#37197;**&#30340;$substring</span>
<span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#22914;&#26524;$substring&#21305;&#37197;$string&#30340;**&#24320;&#22836;&#37096;&#20998;**&#65292;&#37027;&#20040;&#23601;&#29992;$replacement&#26367;&#25442;$substring</span>
${<span style="color: #0087ff;">string</span>/#substring/replacement}
<span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#22914;&#26524;$substring&#21305;&#37197;$string&#30340;**&#32467;&#23614;&#37096;&#20998;**&#65292;&#37027;&#20040;&#23601;&#29992;$replacement&#26367;&#25442;$substring</span>
${<span style="color: #0087ff;">string</span>/%substring/replacement}
</pre>
</div>
</div>
</div>
